chartref/old/mongodb/f/rc1000-op1000/tc8/run2.txt
/usr/lib/jvm/java-11-openjdk-11.0.4.11-0.el7_6.x86_64//bin/java  -classpath /mnt/hdd2/nosql-prj/YCSB/YCSB/conf:/mnt/hdd2/nosql-prj/YCSB/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/mongodb-binding-0.17.0-SNAPSHOT.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/HdrHistogram-2.1.9.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/htrace-core4-4.2.0-incubating.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-classic-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/logback-core-1.1.2.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongodb-async-driver-2.0.1.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/mongo-java-driver-3.8.0.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/slf4j-api-1.7.25.jar:/mnt/hdd2/nosql-prj/YCSB/YCSB/mongodb/target/dependency/snappy-java-1.1.7.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.MongoDbClient -s -p mongodb.url=mongodb://172.16.13.26:27023 -P /mnt/hdd2/nosql-prj/YCSB/YCSB/workloads/workloadf -p recordcount=1000 -threads 8 -p operationcount=1000
mongo client connection created with mongodb://172.16.13.26:27023
[OVERALL], RunTime(ms), 641
[OVERALL], Throughput(ops/sec), 1560.0624024960998
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 6
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.93603744149766
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 6
[TOTAL_GC_TIME_%], Time(%), 0.93603744149766
[READ], Operations, 1000
[READ], AverageLatency(us), 1624.058
[READ], MinLatency(us), 382
[READ], MaxLatency(us), 36767
[READ], 95thPercentileLatency(us), 3693
[READ], 99thPercentileLatency(us), 9663
[READ], Return=OK, 1000
[READ-MODIFY-WRITE], Operations, 536
[READ-MODIFY-WRITE], AverageLatency(us), 2804.5746268656717
[READ-MODIFY-WRITE], MinLatency(us), 900
[READ-MODIFY-WRITE], MaxLatency(us), 58303
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 6039
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 10151
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 345.375
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2759
[CLEANUP], 95thPercentileLatency(us), 2759
[CLEANUP], 99thPercentileLatency(us), 2759
[UPDATE], Operations, 536
[UPDATE], AverageLatency(us), 1114.2182835820895
[UPDATE], MinLatency(us), 379
[UPDATE], MaxLatency(us), 8679
[UPDATE], 95thPercentileLatency(us), 2537
[UPDATE], 99thPercentileLatency(us), 6783
[UPDATE], Return=OK, 536